Table of Contents
 Class ConcreteSLSCheckResultCrackWidthEc2
Namespace
IdeaRS.OpenModel.Concrete.CheckResult
Assembly
IdeaRS.OpenModel.dll
SLS Check Crack width Ec2
public class ConcreteSLSCheckResultCrackWidthEc2 : ConcreteSLSCheckResultCrackWidth
Inheritance
object
ConcreteCheckResultBase
ConcreteSLSCheckResultCrackWidth
ConcreteSLSCheckResultCrackWidthEc2
Inherited Members
 ConcreteCheckResultBase.InternalFores
 ConcreteCheckResultBase.NonConformities
 ConcreteCheckResultBase.Result
 ConcreteCheckResultBase.CheckValue
 ConcreteCheckResultBase.LimitCheckValue
 ConcreteCheckResultBase.Check
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 My
Bending moment around y axis for quasi-permanent combination
public double My { get; set; }
Property Value
double
 Mz
Bending moment around z axis for quasi-permanent combination
public double Mz { get; set; }
Property Value
double
 N
Normal force for quasi-permanent combination
public double N { get; set; }
Property Value
double
 W
calculated crack width value
public double W { get; set; }
Property Value
double
 Wlim
limiting crack width value
public double Wlim { get; set; }
Property Value
double
 Edit this page